# Pandas

### 2878 Creating Dataframe from a list

In [2]:
import pandas as pd
student_data = [
  [1, 15],
  [2, 11],
  [3, 11],
  [4, 20]
]
df = pd.DataFrame(student_data,columns=["student_id","age"])

### 2878 Get the size of a dataframe
- input: dataframe
- output: [n_rows,n_cols]

In [8]:
df.shape

(4, 2)

### 2879 Displaying first 3 rows of a dataframe

In [10]:
df.iloc[:3,]

   student_id  age
0           1   15
1           2   11
2           3   11

### 2880 Select Data

In [14]:
df.loc[df["student_id"]==1][["age"]]

   age
0   15

### 2881 Creating new column 'Bonus'

In [ ]:
employees = pd.DataFrame(
    {
        "name":["Piper","Grace","Georgia","Willow","Finn","Thomas"],
        "salary":[4548,28150,1103,6593,74576,24433]
    }
)

employees["bonus"] = employees["salary"] * 2

      name  salary   bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152
5   Thomas   24433   48866

### 2882 Dropping duplicated rows

In [23]:
customer = pd.DataFrame(
    {
        "customer_id":list(range(1,7)),
        "name":["Ella","David","Zachary","Alice","Finn","Violet"],
        "email":["emily@example.com",
                 "michael@example.com",
                 "sarah@example.com",
                 "john@example.com",
                 "john@example.com",
                 "alice@example.com"]
             }
)

customer.drop_duplicates("email")

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

### 2883 Dropping missing data

In [24]:
student_data = pd.DataFrame(
    {
        "student_id":[32,217,779,849],
        "name":["Piper",None,"Georgia","Willow"],
        "age":[5,19,20,14]
    }
)


student_data.dropna()

   student_id     name  age
0          32    Piper    5
2         779  Georgia   20
3         849   Willow   14

### 2884 Modify Columns

In [25]:
employees = pd.DataFrame(
    {
    "name":["Jack","Piper","Mia","Ulysses"],
    "salary":[19666,74754,62509,54866]
    }
)


employees["salary"] = employees["salary"] * 2

# Leetcode

### 1768 Merge Strings Alternately
You are given two strings word1 and word2. Merge the strings by adding letters in alternating order, starting with word1. If a string is longer than the other, append the additional letters onto the end of the merged string.

In [26]:
def alter_merge_strings(word1,word2):
    out = ""
    #pointer i at the start of both word1 and 2
    for i in range(max(len(word1),len(word2))):
        if i < len(word1):
            out += word1[i]
        if i < len(word2):
            out += word2[i]

    
    return out


alter_merge_strings("abc","pqr")

'apbqcr'